-------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Andrei\Desktop\Dissertation\Dados\master_thesis\StataFiles\agro_struc4.log
  log type:  text
 opened on:  18 Nov 2020, 01:09:31

. 
. 
. **** Preparing Data
. 
. drop year_y

. rename year_x year

. drop pop_dens

. drop pesotot_y

. rename pesotot_x pesotot

. gsort +cod +year

. 
. gen pop_dens = pesotot/geo_area_2010
(592 missing values generated)

. 
. gen log_area = log(geo_area_2010)

. gen log_linten = log(l_inten)
(638 missing values generated)

. gen log_dens = log(pop_dens)
(592 missing values generated)

. gen log_agrival = log(val_outpw)
(640 missing values generated)

. 
. gen log_rdpc = log(RDPC)

. gen rur_share = pesoRUR/POP

. 
. gen log_fao = log(sum_fao)

. gen log_shares = log(pq_shares)
(273 missing values generated)

. 
. 
. gen rural_sh_c = rur_share[_n-2] if year == 2017
(11,116 missing values generated)

. 
. gen pop_dens_c = log_dens[_n-2] if year == 2017
(11,707 missing values generated)

. 
. gen rdpc_c = log_rdpc[_n-2] if year == 2017
(11,116 missing values generated)

. 
. *xtset cod year
. 
. * Generating differences
. gen dlog_linten = log_linten - log_linten[_n-1] if year == 2017 & cod == cod[_n-1]
(11,139 missing values generated)

. gen dlog_dens = log_dens - log_dens[_n-1] if year == 2017 & cod == cod[_n-1]
(11,117 missing values generated)

. gen dlog_agrival = log_agrival - log_agrival[_n-1] if year == 2017 & cod == cod[_n-1]
(11,141 missing values generated)

. 
. 
. gen dnf_tract = nf_tract - nf_tract[_n-1] if year == 2017 & cod == cod[_n-1]
(11,302 missing values generated)

. gen dn_tract = n_tract - n_tract[_n-1] if year == 2017 & cod == cod[_n-1]
(11,432 missing values generated)

. gen dn_maq = n_maq - n_maq[_n-1] if year == 2017 & cod == cod[_n-1]
(11,401 missing values generated)

. 
. 
. 
. 
. /* Generating first differences: attention 1995(census) == 2000(bartik)
> 2015 (bartik) == 2017 (census)
> 2006 == 2006
> */
. 
. * _1 == 2006 - 1995 (2000 in bartik) in measures
. gen dlog_fao_1 = log_fao[_n-1] - log_fao[_n-2] if year == 2017 & cod == cod[_n-1]
(11,116 missing values generated)

. gen dlog_shares_1 = log_shares[_n-1] - log_shares[_n-2] if year == 2017 & cod == cod[_n-1]
(11,207 missing values generated)

. 
. * _1 == 2017(2015) - 2006 (2000 in bartik) in measures
. gen dlog_fao_2 = log_fao - log_fao[_n-1] if year == 2017 & cod == cod[_n-1]
(11,116 missing values generated)

. gen dlog_shares_2 = log_shares - log_shares[_n-1] if year == 2017 & cod == cod[_n-1]
(11,207 missing values generated)

. 
. 
. 
. 
. **********************************************************************************************
. eststo clear    

. eststo: qui reg dlog_agrival dlog_fao_1, robust
(est1 stored)

. 
. eststo: qui reg dlog_agrival dlog_fao_1  dist_state dist_federal ///
>         log_area  latitude longitude altitude ///
>         capital_dummy, robust
(est2 stored)

. 
. eststo: qui reg dlog_agrival dlog_shares_1, robust
(est3 stored)

. 
. eststo: qui reg dlog_agrival dlog_shares_1  dist_state dist_federal ///
>         log_area  latitude longitude altitude ///
>         capital_dummy, robust
(est4 stored)

. 
. esttab, se ar2 keep(dlog_fao_1 dlog_shares_1) compress

--------------------------------------------------------------
                 (1)          (2)          (3)          (4)   
           dlog_ag~l    dlog_ag~l    dlog_ag~l    dlog_ag~l   
--------------------------------------------------------------
dlog_fao_1     0.504***   -0.0595                             
             (0.117)      (0.140)                             

dlog_sha~1                              -0.392***    -0.375***
                                      (0.0633)     (0.0614)   
--------------------------------------------------------------
N               5533         5476         5458         5458   
adj. R-sq      0.003        0.135        0.007        0.143   
--------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
.  
. eststo clear

. eststo: qui ivreg2 dlog_agrival (dlog_shares_2 = dlog_fao_2), robust ffirst savefirst 
(est1 stored)

.  
. eststo: qui ivreg2 dlog_agrival rural_sh_c pop_dens_c rdpc_c (dlog_shares_2 = dlog_fao_2), robust ffirst savefirst
(est2 stored)

.         
. eststo: qui ivreg2 dlog_agrival dist_state dist_federal latitude log_area ///
>  longitude altitude capital_dummy (dlog_shares_2 = dlog_fao_2), robust ffirst savefirst 
(est3 stored)

. 
. eststo: qui ivreg2 dlog_agrival rural_sh_c pop_dens_c rdpc_c dist_state dist_federal latitude log_area ///
>  longitude altitude capital_dummy (dlog_shares_2 = dlog_fao_2), robust ffirst savefirst  
(est4 stored)

. 
.  
. eststo: estimates restore _ivreg2_dlog_shares_2
(results _ivreg2_dlog_shares_2 are active now)
(est5 stored)

. 
. esttab, se ar2 stat (widstat) keep( dlog_shares_2 dlog_fao_2)

--------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)   
             dlog_agrival    dlog_agrival    dlog_agrival    dlog_agrival    dlog_share~2   
--------------------------------------------------------------------------------------------
dlog_share~2       -0.494***       -0.226          -0.223          -0.468**                 
                  (0.147)         (0.150)         (0.149)         (0.171)                   

dlog_fao_2                                                                          0.765***
                                                                                 (0.0335)   
--------------------------------------------------------------------------------------------
widstat             969.2           803.9           774.5           522.9                   
--------------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. *******************************************************************************************
. 
. **********************************************************************************************
. eststo clear    

. eststo: qui reg dlog_linten dlog_fao_1, robust
(est1 stored)

. 
. eststo: qui reg dlog_linten dlog_fao_1  dist_state dist_federal ///
>         log_area  latitude longitude altitude ///
>         capital_dummy, robust
(est2 stored)

. 
. eststo: qui reg dlog_linten dlog_shares_1, robust
(est3 stored)

. 
. eststo: qui reg dlog_linten dlog_shares_1  dist_state dist_federal ///
>         log_area  latitude longitude altitude ///
>         capital_dummy, robust
(est4 stored)

. 
. esttab, se ar2 keep(dlog_fao_1 dlog_shares_1) compress

--------------------------------------------------------------
                 (1)          (2)          (3)          (4)   
           dlog_li~n    dlog_li~n    dlog_li~n    dlog_li~n   
--------------------------------------------------------------
dlog_fao_1     0.494***    0.0975                             
            (0.0662)     (0.0840)                             

dlog_sha~1                               0.192***     0.111** 
                                      (0.0392)     (0.0403)   
--------------------------------------------------------------
N               5535         5478         5459         5459   
adj. R-sq      0.008        0.064        0.004        0.066   
--------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
.  
. eststo clear

. eststo: qui ivreg2 dlog_linten (dlog_shares_2 = dlog_fao_2), robust ffirst savefirst 
(est1 stored)

.  
. eststo: qui ivreg2 dlog_linten rural_sh_c pop_dens_c rdpc_c (dlog_shares_2 = dlog_fao_2), robust ffirst savefirst
(est2 stored)

.         
. eststo: qui ivreg2 dlog_linten dist_state dist_federal latitude log_area ///
>  longitude altitude capital_dummy (dlog_shares_2 = dlog_fao_2), robust ffirst savefirst 
(est3 stored)

. 
. eststo: qui ivreg2 dlog_linten rural_sh_c pop_dens_c rdpc_c dist_state dist_federal latitude log_area ///
>  longitude altitude capital_dummy (dlog_shares_2 = dlog_fao_2), robust ffirst savefirst  
(est4 stored)

. 
.  
. eststo: estimates restore _ivreg2_dlog_shares_2
(results _ivreg2_dlog_shares_2 are active now)
(est5 stored)

. 
. esttab, se ar2 stat (widstat) keep( dlog_shares_2 dlog_fao_2)

--------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)   
              dlog_linten     dlog_linten     dlog_linten     dlog_linten    dlog_share~2   
--------------------------------------------------------------------------------------------
dlog_share~2       -0.397***       -0.182         -0.0269           0.139                   
                 (0.0898)        (0.0948)        (0.0949)         (0.110)                   

dlog_fao_2                                                                          0.765***
                                                                                 (0.0335)   
--------------------------------------------------------------------------------------------
widstat             970.1           804.4           774.7           523.3                   
--------------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. *******************************************************************************************
. 
. 
. 
. **********************************************************************************************
. eststo clear    

. eststo: qui reg dnf_tract dlog_fao_1, robust
(est1 stored)

. 
. eststo: qui reg dnf_tract dlog_fao_1  dist_state dist_federal ///
>         log_area  latitude longitude altitude ///
>         capital_dummy, robust
(est2 stored)

. 
. eststo: qui reg dnf_tract dlog_shares_1, robust
(est3 stored)

. 
. eststo: qui reg dnf_tract dlog_shares_1  dist_state dist_federal ///
>         log_area  latitude longitude altitude ///
>         capital_dummy, robust
(est4 stored)

. 
. esttab, se ar2 keep(dlog_fao_1 dlog_shares_1) compress

--------------------------------------------------------------
                 (1)          (2)          (3)          (4)   
           dnf_tract    dnf_tract    dnf_tract    dnf_tract   
--------------------------------------------------------------
dlog_fao_1    -78.36***    -24.62*                            
             (13.76)      (11.88)                             

dlog_sha~1                              -87.46***    -55.60***
                                       (7.300)      (5.850)   
--------------------------------------------------------------
N               5372         5317         5300         5300   
adj. R-sq      0.009        0.211        0.040        0.225   
--------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
.  
. eststo clear

. eststo: qui ivreg2 dnf_tract (dlog_shares_2 = dlog_fao_2), robust ffirst savefirst 
(est1 stored)

.  
. eststo: qui ivreg2 dnf_tract rural_sh_c pop_dens_c rdpc_c (dlog_shares_2 = dlog_fao_2), robust ffirst savefirst
(est2 stored)

.         
. eststo: qui ivreg2 dnf_tract dist_state dist_federal latitude log_area ///
>  longitude altitude capital_dummy (dlog_shares_2 = dlog_fao_2), robust ffirst savefirst 
(est3 stored)

. 
. eststo: qui ivreg2 dnf_tract rural_sh_c pop_dens_c rdpc_c dist_state dist_federal latitude log_area ///
>  longitude altitude capital_dummy (dlog_shares_2 = dlog_fao_2), robust ffirst savefirst  
(est4 stored)

. 
.  
. eststo: estimates restore _ivreg2_dlog_shares_2
(results _ivreg2_dlog_shares_2 are active now)
(est5 stored)

. 
. esttab, se ar2 stat (widstat) keep( dlog_shares_2 dlog_fao_2)

--------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)   
                dnf_tract       dnf_tract       dnf_tract       dnf_tract    dlog_share~2   
--------------------------------------------------------------------------------------------
dlog_share~2        168.2***        169.8***        79.83***        77.42***                
                  (18.32)         (18.08)         (12.62)         (15.10)                   

dlog_fao_2                                                                          0.760***
                                                                                 (0.0339)   
--------------------------------------------------------------------------------------------
widstat             947.9           798.7           739.9           503.7                   
--------------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. *******************************************************************************************
. 
. 
. 
. 
. **********************************************************************************************
. eststo clear    

. eststo: qui reg dn_tract dlog_fao_1, robust
(est1 stored)

. 
. eststo: qui reg dn_tract dlog_fao_1  dist_state dist_federal ///
>         log_area  latitude longitude altitude ///
>         capital_dummy, robust
(est2 stored)

. 
. eststo: qui reg dn_tract dlog_shares_1, robust
(est3 stored)

. 
. eststo: qui reg dn_tract dlog_shares_1  dist_state dist_federal ///
>         log_area  latitude longitude altitude ///
>         capital_dummy, robust
(est4 stored)

. 
. esttab, se ar2 keep(dlog_fao_1 dlog_shares_1) compress

--------------------------------------------------------------
                 (1)          (2)          (3)          (4)   
            dn_tract     dn_tract     dn_tract     dn_tract   
--------------------------------------------------------------
dlog_fao_1    -41.66        39.41*                            
             (23.44)      (19.40)                             

dlog_sha~1                              -149.4***    -90.61***
                                       (11.57)      (9.216)   
--------------------------------------------------------------
N               5242         5188         5172         5172   
adj. R-sq      0.001        0.279        0.037        0.292   
--------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
.  
. eststo clear

. eststo: qui ivreg2 dn_tract (dlog_shares_2 = dlog_fao_2), robust ffirst savefirst 
(est1 stored)

.  
. eststo: qui ivreg2 dn_tract rural_sh_c pop_dens_c rdpc_c (dlog_shares_2 = dlog_fao_2), robust ffirst savefirst
(est2 stored)

.         
. eststo: qui ivreg2 dn_tract dist_state dist_federal latitude log_area ///
>  longitude altitude capital_dummy (dlog_shares_2 = dlog_fao_2), robust ffirst savefirst 
(est3 stored)

. 
. eststo: qui ivreg2 dn_tract rural_sh_c pop_dens_c rdpc_c dist_state dist_federal latitude log_area ///
>  longitude altitude capital_dummy (dlog_shares_2 = dlog_fao_2), robust ffirst savefirst  
(est4 stored)

. 
.  
. eststo: estimates restore _ivreg2_dlog_shares_2
(results _ivreg2_dlog_shares_2 are active now)
(est5 stored)

. 
. esttab, se ar2 stat (widstat) keep( dlog_shares_2 dlog_fao_2)

--------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)   
                 dn_tract        dn_tract        dn_tract        dn_tract    dlog_share~2   
--------------------------------------------------------------------------------------------
dlog_share~2        133.3***        205.8***        4.284           32.96                   
                  (29.43)         (28.35)         (19.89)         (23.13)                   

dlog_fao_2                                                                          0.762***
                                                                                 (0.0340)   
--------------------------------------------------------------------------------------------
widstat             943.8           809.2           735.7           501.9                   
--------------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. *******************************************************************************************
. 
. 
. **********************************************************************************************
. eststo clear    

. eststo: qui reg dn_maq  dlog_fao_1, robust
(est1 stored)

. 
. eststo: qui reg dn_maq  dlog_fao_1  dist_state dist_federal ///
>         log_area  latitude longitude altitude ///
>         capital_dummy, robust
(est2 stored)

. 
. eststo: qui reg dn_maq  dlog_shares_1, robust
(est3 stored)

. 
. eststo: qui reg dn_maq  dlog_shares_1  dist_state dist_federal ///
>         log_area  latitude longitude altitude ///
>         capital_dummy, robust
(est4 stored)

. 
. esttab, se ar2 keep(dlog_fao_1 dlog_shares_1) compress

--------------------------------------------------------------
                 (1)          (2)          (3)          (4)   
              dn_maq       dn_maq       dn_maq       dn_maq   
--------------------------------------------------------------
dlog_fao_1    -44.64        96.07**                           
             (38.73)      (30.84)                             

dlog_sha~1                              -238.3***    -144.2***
                                       (18.16)      (14.63)   
--------------------------------------------------------------
N               5273         5219         5204         5204   
adj. R-sq      0.000        0.272        0.035        0.284   
--------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
.  
. eststo clear

. eststo: qui ivreg2 dn_maq  (dlog_shares_2 = dlog_fao_2), robust ffirst savefirst 
(est1 stored)

.  
. eststo: qui ivreg2 dn_maq  rural_sh_c pop_dens_c rdpc_c (dlog_shares_2 = dlog_fao_2), robust ffirst savefirst
(est2 stored)

.         
. eststo: qui ivreg2 dn_maq  dist_state dist_federal latitude log_area ///
>  longitude altitude capital_dummy (dlog_shares_2 = dlog_fao_2), robust ffirst savefirst 
(est3 stored)

. 
. eststo: qui ivreg2 dn_maq rural_sh_c pop_dens_c rdpc_c dist_state dist_federal latitude log_area ///
>  longitude altitude capital_dummy (dlog_shares_2 = dlog_fao_2), robust ffirst savefirst  
(est4 stored)

. 
.  
. eststo: estimates restore _ivreg2_dlog_shares_2
(results _ivreg2_dlog_shares_2 are active now)
(est5 stored)

. 
. esttab, se ar2 stat (widstat) keep( dlog_shares_2 dlog_fao_2)

--------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)   
                   dn_maq          dn_maq          dn_maq          dn_maq    dlog_share~2   
--------------------------------------------------------------------------------------------
dlog_share~2        207.7***        358.0***       -20.05           39.24                   
                  (48.71)         (47.75)         (32.65)         (38.02)                   

dlog_fao_2                                                                          0.754***
                                                                                 (0.0341)   
--------------------------------------------------------------------------------------------
widstat             931.0           794.7           722.5           488.9                   
--------------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. *******************************************************************************************
. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\Andrei\Desktop\Dissertation\Dados\master_thesis\StataFiles\agro_struc4.log
  log type:  text
 closed on:  18 Nov 2020, 01:09:37
-------------------------------------------------------------------------------------------------------------------------
