-------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Andrei\Desktop\Dissertation\Dados\master_thesis\StataFiles\fao_andrei.log
  log type:  text
 opened on:  29 Oct 2020, 10:08:09

. xtset cod year
       panel variable:  cod (strongly balanced)
        time variable:  year, 2000 to 2010, but with gaps
                delta:  1 unit

. 
. ***************** DIFERENÃ‡AS **************************************************
. 
. gen dlog_fao = log_fao - log_fao[_n-1] if year == 2010 & cod == cod[_n-1]
(5,563 missing values generated)

. gen dlog_pquant = log_pquant - log_pquant[_n-1] if year == 2010 & cod == cod[_n-1]
(5,659 missing values generated)

. gen dlog_pqshares = log_pqshares - log_pqshares[_n-1] if year == 2010 & cod == cod[_n-1]
(5,659 missing values generated)

. 
. 
. gen dlog_rdpc = log_rdpc - log_rdpc[_n-1] if year == 2010 & cod == cod[_n-1]
(5,568 missing values generated)

. gen dlog_pib_pc = log_pib_pc - log_pib_pc[_n-1] if year == 2010 & cod == cod[_n-1]
(5,626 missing values generated)

. 
. 
. gen dlog_rev_impost_tot = log_rev_impost_tot - log_rev_impost_tot[_n-1] if year == 2010 & cod == cod[_n-1]
(5,568 missing values generated)

. gen dlog_rev_iptu = log_rev_iptu - log_rev_iptu[_n-1] if year == 2010 & cod == cod[_n-1]
(5,568 missing values generated)

. gen dlog_rev_itr = log_rev_itr - log_rev_itr[_n-1] if year == 2010 & cod == cod[_n-1]
(5,570 missing values generated)

. 
. 
. gen dlog_exp_func_total = log_exp_func_total - log_exp_func_total[_n-1] if year == 2010 & cod == cod[_n-1]
(5,568 missing values generated)

. gen dlog_exp_educ = log_exp_educ - log_exp_educ[_n-1] if year == 2010 & cod == cod[_n-1]
(5,568 missing values generated)

. gen dlog_exp_habit = log_exp_habit - log_exp_habit[_n-1] if year == 2010 & cod == cod[_n-1]
(5,568 missing values generated)

. gen dlog_exp_saude = log_exp_saude - log_exp_saude[_n-1] if year == 2010 & cod == cod[_n-1]
(5,568 missing values generated)

. 
. 
. gen dT_AGUA = T_AGUA - T_AGUA[_n-1] if year == 2010 & cod == cod[_n-1]
(5,568 missing values generated)

. gen dT_ANALF18M = T_ANALF18M - T_ANALF18M[_n-1] if year == 2010 & cod == cod[_n-1]
(5,568 missing values generated)

. gen dGINI = GINI - GINI[_n-1] if year == 2010 & cod == cod[_n-1]
(5,568 missing values generated)

. gen dT_LUZ = T_LUZ - T_LUZ[_n-1] if year == 2010 & cod == cod[_n-1]
(5,568 missing values generated)

. gen dgini_land = gini_land - gini_land[_n-1] if year == 2010 & cod == cod[_n-1]
(6,195 missing values generated)

. 
. 
. gen destab_total = estab_total - estab_total[_n-1] if year == 2010 & cod == cod[_n-1]
(5,573 missing values generated)

. gen destab_tot_pub = estab_tot_pub - estab_tot_pub[_n-1] if year == 2010 & cod == cod[_n-1]
(5,573 missing values generated)

. gen destab_munic = estab_munic - estab_munic[_n-1] if year == 2010 & cod == cod[_n-1]
(5,573 missing values generated)

. 
. 
. gen datend_total = atend_total - atend_total[_n-1] if year == 2010 & cod == cod[_n-1]
(5,573 missing values generated)

. gen datend_total_pub = atend_total_pub - atend_total_pub[_n-1] if year == 2010 & cod == cod[_n-1]
(5,573 missing values generated)

. gen datend_total_priv = atend_total_priv - atend_total_priv[_n-1] if year == 2010 & cod == cod[_n-1]
(5,573 missing values generated)

. 
. 
. gen dleitos_total = leitos_total - leitos_total[_n-1] if year == 2010 & cod == cod[_n-1]
(5,573 missing values generated)

. gen dleitos_munic = leitos_munic - leitos_munic[_n-1] if year == 2010 & cod == cod[_n-1]
(5,573 missing values generated)

. gen dleitos_total_priv = estab_munic - estab_munic[_n-1] if year == 2010 & cod == cod[_n-1]
(5,573 missing values generated)

. 
. 
. 
. *foreach v of varlist estab_total-leitos_sus {
.         *gen d`v' = `v' - `v'[_n-1] if year == 2010 & cod == cod[_n-1]
. *}
. 
. ** Regressions
. 
. eststo clear

. 
. eststo: qui reg dlog_rdpc dlog_fao dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est1 stored)

.                                 
. eststo: qui reg dlog_rdpc dlog_pqshares dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est2 stored)

. 
. eststo: qui reg dlog_pib_pc dlog_fao dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est3 stored)

.                                 
. eststo: qui reg dlog_pib_pc dlog_pqshares dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est4 stored)

. 
. esttab, se ar2 keep(dlog_fao dlog_pqshares) compress

--------------------------------------------------------------
                 (1)          (2)          (3)          (4)   
           dlog_rdpc    dlog_rdpc    dlog_pi~c    dlog_pi~c   
--------------------------------------------------------------
dlog_fao      -0.330***                -0.0789                
            (0.0385)                  (0.0627)                

dlog_pqs~s                 -0.208***                -0.0781*  
                         (0.0220)                  (0.0359)   
--------------------------------------------------------------
N               5500         5467         5500         5467   
adj. R-sq      0.101        0.105        0.016        0.017   
--------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. *foreach v of varlist log_rdpc log_pib_pc {
. *       eststo clear
. *       
. *       eststo: qui reghdfe `v' log_fao  c.dist_state#i.year c.dist_federal#i.year ///
> *       c.log_area#i.year  c.latitude#i.year c.longitude#i.year c.altitude#i.year ///
> *       c.capital_dummy#i.year, absorb (cod year)
. *       
. *    eststo: qui reghdfe `v' log_pqshares  c.dist_state#i.year c.dist_federal#i.year ///
> *       c.log_area#i.year  c.latitude#i.year c.longitude#i.year c.altitude#i.year ///
> *       c.capital_dummy#i.year, absorb (cod year)
.         
. *       esttab, se ar2 keep(log_fao log_pqshares)
. *}
. 
. 
. 
. eststo clear

. 
. eststo: qui reg dlog_rev_impost_tot dlog_fao dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est1 stored)

.                                 
. eststo: qui reg dlog_rev_impost_tot dlog_pqshares dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est2 stored)

. 
. eststo: qui reg dlog_rev_iptu dlog_fao dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est3 stored)

. 
. eststo: qui reg dlog_rev_iptu dlog_pqshares dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est4 stored)

. 
. esttab, se ar2 keep(dlog_fao dlog_pqshares) compress

--------------------------------------------------------------
                 (1)          (2)          (3)          (4)   
           dlog_re~t    dlog_re~t    dlog_re~u    dlog_re~u   
--------------------------------------------------------------
dlog_fao      -0.964***                -0.0439                
             (0.189)                   (0.130)                

dlog_pqs~s                 -0.364***                -0.0689   
                          (0.108)                  (0.0748)   
--------------------------------------------------------------
N               5500         5467         5500         5467   
adj. R-sq      0.105        0.101        0.026        0.027   
--------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. eststo clear

. 
. eststo: qui reg dlog_rev_itr dlog_fao dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est1 stored)

. eststo: qui reg dlog_rev_itr dlog_pqshares dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est2 stored)

. 
. esttab, se ar2 keep(dlog_fao dlog_pqshares) compress

------------------------------------
                 (1)          (2)   
           dlog_re~r    dlog_re~r   
------------------------------------
dlog_fao       0.464**              
             (0.145)                

dlog_pqs~s                 -0.195*  
                         (0.0832)   
------------------------------------
N               5498         5465   
adj. R-sq      0.124        0.122   
------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. *foreach v of varlist log_rev_impost_tot log_rev_iptu log_rev_itr{
. *       eststo clear
.         
. *       eststo: qui reghdfe `v' log_fao  c.dist_state#i.year c.dist_federal#i.year ///
> *       c.log_area#i.year  c.latitude#i.year c.longitude#i.year c.altitude#i.year ///
> *       c.capital_dummy#i.year, absorb (cod year) vce (cluster cod)
.         
. *   eststo: qui reghdfe `v' log_pqshares  c.dist_state#i.year c.dist_federal#i.year ///
> *       c.log_area#i.year  c.latitude#i.year c.longitude#i.year c.altitude#i.year ///
> *       c.capital_dummy#i.year, absorb (cod year) vce (cluster cod)
.         
. *       esttab, se ar2 keep(log_fao log_pqshares)
. *}
. 
. 
. 
. 
. eststo clear

. eststo: qui reg dlog_exp_func_total dlog_fao dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est1 stored)

.                                 
. eststo: qui reg dlog_exp_func_total dlog_pqshares dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est2 stored)

. 
. eststo: qui reg dlog_exp_educ dlog_fao dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est3 stored)

. 
. eststo: qui reg dlog_exp_educ dlog_pqshares dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est4 stored)

. 
. esttab, se ar2 keep(dlog_fao dlog_pqshares) compress

--------------------------------------------------------------
                 (1)          (2)          (3)          (4)   
           dlog_ex~l    dlog_ex~l    dlog_ex~c    dlog_ex~c   
--------------------------------------------------------------
dlog_fao      -0.245                    -0.195                
             (0.284)                   (0.255)                

dlog_pqs~s                 0.0999                     0.138   
                          (0.163)                   (0.146)   
--------------------------------------------------------------
N               5500         5467         5500         5467   
adj. R-sq      0.040        0.040        0.070        0.070   
--------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. 
. eststo clear

. eststo: qui reg dlog_exp_habit dlog_fao dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est1 stored)

.                                 
. eststo: qui reg dlog_exp_habit dlog_pqshares dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est2 stored)

. 
. eststo: qui reg dlog_exp_saude dlog_fao dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est3 stored)

.                                 
. eststo: qui reg dlog_exp_saude dlog_pqshares dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est4 stored)

. 
. esttab, se ar2 keep(dlog_fao dlog_pqshares) compress

--------------------------------------------------------------
                 (1)          (2)          (3)          (4)   
           dlog_ex~t    dlog_ex~t    dlog_ex~e    dlog_ex~e   
--------------------------------------------------------------
dlog_fao      -1.274***                 -0.498*               
             (0.303)                   (0.249)                

dlog_pqs~s                 -0.273                   -0.0596   
                          (0.174)                   (0.143)   
--------------------------------------------------------------
N               5500         5467         5500         5467   
adj. R-sq      0.013        0.010        0.024        0.023   
--------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. *foreach v of varlist log_exp_func_total        log_exp_educ log_exp_habit log_exp_saude  {
. *       eststo clear
.         
. *       eststo: qui reghdfe `v' log_fao  c.dist_state#i.year c.dist_federal#i.year ///
> *       c.log_area#i.year  c.latitude#i.year c.longitude#i.year c.altitude#i.year ///
> *       c.capital_dummy#i.year, absorb (cod year) vce (cluster cod)
.         
. *   eststo: qui reghdfe `v' log_pqshares  c.dist_state#i.year c.dist_federal#i.year ///
> *       c.log_area#i.year  c.latitude#i.year c.longitude#i.year c.altitude#i.year ///
> *       c.capital_dummy#i.year, absorb (cod year) vce (cluster cod)
.         
. *       esttab, se ar2 keep(log_fao log_pqshares)
. *}
. 
. 
. eststo clear

. 
. eststo: qui reg dGINI dlog_fao dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est1 stored)

.                                 
. eststo: qui reg dGINI dlog_pqshares dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est2 stored)

. 
. eststo: qui reg dT_LUZ dlog_fao dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est3 stored)

.                                 
. eststo: qui reg dT_LUZ dlog_pqshares dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est4 stored)

. 
. esttab, se ar2 keep(dlog_fao dlog_pqshares) compress

--------------------------------------------------------------
                 (1)          (2)          (3)          (4)   
               dGINI        dGINI       dT_LUZ       dT_LUZ   
--------------------------------------------------------------
dlog_fao      0.0353**                  -25.25***             
            (0.0126)                   (2.082)                

dlog_pqs~s                 0.0230**                  -10.47***
                        (0.00724)                   (1.201)   
--------------------------------------------------------------
N               5500         5467         5500         5467   
adj. R-sq      0.054        0.054        0.358        0.348   
--------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. eststo clear

. 
. eststo: qui reg dT_AGUA dlog_fao dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est1 stored)

.                                 
. eststo: qui reg dT_AGUA dlog_pqshares dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est2 stored)

. 
. eststo: qui reg dT_ANALF18M dlog_fao dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est3 stored)

. 
. eststo: qui reg dT_ANALF18M dlog_pqshares dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est4 stored)

. 
. esttab, se ar2 keep(dlog_fao dlog_pqshares) compress

--------------------------------------------------------------
                 (1)          (2)          (3)          (4)   
             dT_AGUA      dT_AGUA    dT_AN~18M    dT_AN~18M   
--------------------------------------------------------------
dlog_fao      -7.351*                   -3.047***             
             (3.000)                   (0.545)                

dlog_pqs~s                 -2.316                    -0.196   
                          (1.717)                   (0.313)   
--------------------------------------------------------------
N               5500         5467         5500         5467   
adj. R-sq      0.537        0.538        0.435        0.431   
--------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. eststo clear

. 
. eststo: qui reg dgini_land dlog_fao dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est1 stored)

.                                 
. eststo: qui reg dgini_land dlog_pqshares dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est2 stored)

. 
. eststo: qui reg dgini_land dlog_fao dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est3 stored)

. 
. eststo: qui reg dgini_land dlog_pqshares dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est4 stored)

. 
. esttab, se ar2 keep(dlog_fao dlog_pqshares) compress

--------------------------------------------------------------
                 (1)          (2)          (3)          (4)   
           dgini_l~d    dgini_l~d    dgini_l~d    dgini_l~d   
--------------------------------------------------------------
dlog_fao      0.0618***                 0.0618***             
            (0.0186)                  (0.0186)                

dlog_pqs~s                 0.0436***                 0.0436***
                         (0.0105)                  (0.0105)   
--------------------------------------------------------------
N               4931         4917         4931         4917   
adj. R-sq      0.039        0.040        0.039        0.040   
--------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. *foreach v of varlist T_AGUA T_ANALF18M GINI T_LUZ gini_land {
. *       eststo clear
.         
. *       eststo: qui reghdfe `v' log_fao  c.dist_state#i.year c.dist_federal#i.year ///
> *       c.log_area#i.year  c.latitude#i.year c.longitude#i.year c.altitude#i.year ///
> *       c.capital_dummy#i.year, absorb (cod year)
.         
. *   eststo: qui reghdfe `v' log_pqshares  c.dist_state#i.year c.dist_federal#i.year ///
> *       c.log_area#i.year  c.latitude#i.year c.longitude#i.year c.altitude#i.year ///
> *       c.capital_dummy#i.year, absorb (cod year)
.         
. *       esttab, se ar2 keep(log_fao log_pqshares)
. *}
. 
. 
. eststo clear

. 
. eststo: qui reg destab_total dlog_fao dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est1 stored)

.                                 
. eststo: qui reg destab_total dlog_pqshares dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est2 stored)

. 
. eststo: qui reg destab_tot_pub dlog_fao dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est3 stored)

.                                 
. eststo: qui reg destab_tot_pub dlog_pqshares dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est4 stored)

. 
. eststo: qui reg destab_munic dlog_fao dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est5 stored)

.                                 
. eststo: qui reg destab_munic dlog_pqshares dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est6 stored)

. 
. esttab, se ar2 keep(dlog_fao dlog_pqshares) compress

----------------------------------------------------------------------------------------
                 (1)          (2)          (3)          (4)          (5)          (6)   
           destab_~l    destab_~l    destab_~b    destab_~b    destab_~c    destab_~c   
----------------------------------------------------------------------------------------
dlog_fao       12.87***                  6.844***                  6.515***             
             (3.631)                   (1.016)                   (1.037)                

dlog_pqs~s                  7.704***                  3.661***                  3.666***
                          (2.047)                   (0.577)                   (0.587)   
----------------------------------------------------------------------------------------
N               5500         5467         5500         5467         5500         5467   
adj. R-sq      0.383        0.386        0.134        0.126        0.155        0.144   
----------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. *foreach v of varlist estab_total estab_tot_pub estab_munic {
. *       eststo clear
.         
. *       eststo: qui reghdfe `v' log_fao  c.dist_state#i.year c.dist_federal#i.year ///
> *       c.log_area#i.year  c.latitude#i.year c.longitude#i.year c.altitude#i.year ///
> *       c.capital_dummy#i.year, absorb (cod year)
. *       
.  *   eststo: qui reghdfe `v' log_pqshares  c.dist_state#i.year c.dist_federal#i.year ///
>         *c.log_area#i.year  c.latitude#i.year c.longitude#i.year c.altitude#i.year ///
>         *c.capital_dummy#i.year, absorb (cod year)
.         *
.         *esttab, se ar2 keep(log_fao log_pqshares)
. *}
. 
. 
. 
. eststo clear

. 
. eststo: qui reg datend_total dlog_fao dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est1 stored)

.                                 
. eststo: qui reg datend_total dlog_pqshares dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est2 stored)

. 
. eststo: qui reg datend_total_pub dlog_fao dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est3 stored)

.                                 
. eststo: qui reg datend_total_pub dlog_pqshares dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est4 stored)

. 
. eststo: qui reg datend_total_priv dlog_fao dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est5 stored)

.                                 
. eststo: qui reg datend_total_priv dlog_pqshares dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est6 stored)

. 
. esttab, se ar2 keep(dlog_fao dlog_pqshares) compress

----------------------------------------------------------------------------------------
                 (1)          (2)          (3)          (4)          (5)          (6)   
           datend_~l    datend_~l    datend_~b    datend_~b    datend_~v    datend_~v   
----------------------------------------------------------------------------------------
dlog_fao       12.87***                  6.844***                  6.028                
             (3.631)                   (1.016)                   (3.228)                

dlog_pqs~s                  7.704***                  3.661***                  4.042*  
                          (2.047)                   (0.577)                   (1.817)   
----------------------------------------------------------------------------------------
N               5500         5467         5500         5467         5500         5467   
adj. R-sq      0.383        0.386        0.134        0.126        0.382        0.389   
----------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. 
. *foreach v of varlist atend_total atend_total_pub atend_total_priv {
. *       eststo clear
.         
. *       eststo: qui reghdfe `v' log_fao  c.dist_state#i.year c.dist_federal#i.year ///
> *       c.log_area#i.year  c.latitude#i.year c.longitude#i.year c.altitude#i.year ///
> *       c.capital_dummy#i.year, absorb (cod year)
.         
.  *   eststo: qui reghdfe `v' log_pqshares  c.dist_state#i.year c.dist_federal#i.year ///
>         *c.log_area#i.year  c.latitude#i.year c.longitude#i.year c.altitude#i.year ///
>         *c.capital_dummy#i.year, absorb (cod year)
.         
.         *esttab, se ar2 keep(log_fao log_pqshares) compress
. *}
. 
. eststo clear

. 
. eststo: qui reg dleitos_total dlog_fao dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est1 stored)

.                                 
. eststo: qui reg dleitos_total dlog_pqshares dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est2 stored)

. 
. eststo: qui reg dleitos_munic dlog_fao dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est3 stored)

.                                 
. eststo: qui reg dleitos_munic dlog_pqshares dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est4 stored)

. 
. eststo: qui reg dleitos_total_priv dlog_fao dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est5 stored)

.                                 
. eststo: qui reg dleitos_total_priv dlog_pqshares dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy
(est6 stored)

. 
. esttab, se ar2 keep(dlog_fao dlog_pqshares) compress

----------------------------------------------------------------------------------------
                 (1)          (2)          (3)          (4)          (5)          (6)   
           dleitos~l    dleitos~l    dleitos~c    dleitos~c    dleitos~v    dleitos~v   
----------------------------------------------------------------------------------------
dlog_fao      -15.99                   -0.0362                     6.515***             
             (15.65)                   (5.228)                   (1.037)                

dlog_pqs~s                  6.030                     5.912*                    3.666***
                          (8.644)                   (2.913)                   (0.587)   
----------------------------------------------------------------------------------------
N               5500         5467         5500         5467         5500         5467   
adj. R-sq      0.048        0.036        0.002        0.004        0.155        0.144   
----------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. 
. *foreach v of varlist leitos_total leitos_munic leitos_total_priv {
. *eststo clear   
. *       eststo: qui reghdfe `v' log_fao  c.dist_state#i.year c.dist_federal#i.year ///
> *       c.log_area#i.year  c.latitude#i.year c.longitude#i.year c.altitude#i.year ///
> *       c.capital_dummy#i.year, absorb (cod year)
. *       
.  *   eststo: qui reghdfe `v' log_pqshares  c.dist_state#i.year c.dist_federal#i.year ///
>         *c.log_area#i.year  c.latitude#i.year c.longitude#i.year c.altitude#i.year ///
>         *c.capital_dummy#i.year, absorb (cod year)
.         
. *       esttab, se ar2 keep(log_fao log_pqshares)
. *}
. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\Andrei\Desktop\Dissertation\Dados\master_thesis\StataFiles\fao_andrei.log
  log type:  text
 closed on:  29 Oct 2020, 10:08:10
-------------------------------------------------------------------------------------------------------------------------
