-------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Andrei\Desktop\Dissertation\Dados\master_thesis\StataFiles\fao_fin.log
  log type:  text
 opened on:  28 Oct 2020, 19:15:31

. 
. 
. foreach v of varlist rev_itr-transf_estad{
  2. 
. eststo clear
  3. 
. eststo: qui reghdfe `v' log_fao c.altitude#i.year c.dist_federal#i.year c.dist_state#i.year c.log_area#i.year ///
>                            c.latitude#i.year c.longitude#i.year ///
>                            c.capital_dummy#i.year, absorb (cod year) vce(cluster cod)
  4.                            
. eststo: qui reghdfe `v' log_pqshares c.altitude#i.year c.dist_federal#i.year c.dist_state#i.year c.log_area#i.year ///
>                            c.latitude#i.year c.longitude#i.year ///
>                            c.capital_dummy#i.year, absorb (cod year) vce(cluster cod)
  5.                            
. eststo: qui reghdfe `v' dq10red2_fao c.altitude#i.year c.dist_federal#i.year c.dist_state#i.year c.log_area#i.year ///
>                            c.latitude#i.year c.longitude#i.year ///
>                            c.capital_dummy#i.year, absorb (cod year) vce(cluster cod)
  6.                            
. eststo: qui reghdfe `v' dq10red2_sh c.altitude#i.year c.dist_federal#i.year c.dist_state#i.year c.log_area#i.year ///
>                            c.latitude#i.year c.longitude#i.year ///
>                            c.capital_dummy#i.year, absorb (cod year) vce(cluster cod)
  7.                            
. eststo: qui reghdfe `v' dq25red2_fao c.altitude#i.year c.dist_federal#i.year c.dist_state#i.year c.log_area#i.year ///
>                            c.latitude#i.year c.longitude#i.year ///
>                            c.capital_dummy#i.year, absorb (cod year) vce(cluster cod)
  8.                            
. eststo: qui reghdfe `v' dq25red2_sh c.altitude#i.year c.dist_federal#i.year c.dist_state#i.year c.log_area#i.year ///
>                            c.latitude#i.year c.longitude#i.year ///
>                            c.capital_dummy#i.year, absorb (cod year) vce(cluster cod)
  9. 
. esttab, se ar2 keep(log_fao log_pqshares dq10red2_fao dq10red2_sh dq25red2_fao dq25red2_sh) compress
 10. 
. }
(est1 stored)
(est2 stored)
(est3 stored)
(est4 stored)
(est5 stored)
(est6 stored)

----------------------------------------------------------------------------------------
                 (1)          (2)          (3)          (4)          (5)          (6)   
             rev_itr      rev_itr      rev_itr      rev_itr      rev_itr      rev_itr   
----------------------------------------------------------------------------------------
log_fao        0.161                                                                    
             (0.163)                                                                    

log_pqsh~s                  0.120                                                       
                         (0.0684)                                                       

dq10red2~o                              0.0433                                          
                                      (0.0246)                                          

dq10red2~h                                           0.0716**                           
                                                   (0.0266)                             

dq25red2~o                                                        0.0386*               
                                                                (0.0185)                

dq25red2~h                                                                     0.0337   
                                                                             (0.0181)   
----------------------------------------------------------------------------------------
N              60500        60137        60500        60500        60500        60500   
adj. R-sq      0.762        0.765        0.762        0.762        0.762        0.762   
----------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
(est1 stored)
(est2 stored)
(est3 stored)
(est4 stored)
(est5 stored)
(est6 stored)

----------------------------------------------------------------------------------------
                 (1)          (2)          (3)          (4)          (5)          (6)   
           rev_imp~t    rev_imp~t    rev_imp~t    rev_imp~t    rev_imp~t    rev_imp~t   
----------------------------------------------------------------------------------------
log_fao       -0.207                                                                    
             (0.212)                                                                    

log_pqsh~s                 -0.131                                                       
                         (0.0941)                                                       

dq10red2~o                            -0.00186                                          
                                      (0.0367)                                          

dq10red2~h                                          -0.0223                             
                                                   (0.0387)                             

dq25red2~o                                                        0.0207                
                                                                (0.0262)                

dq25red2~h                                                                   -0.00772   
                                                                             (0.0274)   
----------------------------------------------------------------------------------------
N              60500        60137        60500        60500        60500        60500   
adj. R-sq      0.331        0.327        0.331        0.331        0.331        0.331   
----------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
(est1 stored)
(est2 stored)
(est3 stored)
(est4 stored)
(est5 stored)
(est6 stored)

----------------------------------------------------------------------------------------
                 (1)          (2)          (3)          (4)          (5)          (6)   
           rev_imp~s    rev_imp~s    rev_imp~s    rev_imp~s    rev_imp~s    rev_imp~s   
----------------------------------------------------------------------------------------
log_fao       -0.998***                                                                 
             (0.208)                                                                    

log_pqsh~s                 -0.201*                                                      
                         (0.0918)                                                       

dq10red2~o                             -0.0811*                                         
                                      (0.0357)                                          

dq10red2~h                                          -0.0598                             
                                                   (0.0382)                             

dq25red2~o                                                       -0.0679**              
                                                                (0.0259)                

dq25red2~h                                                                    -0.0274   
                                                                             (0.0268)   
----------------------------------------------------------------------------------------
N              60500        60137        60500        60500        60500        60500   
adj. R-sq      0.406        0.405        0.406        0.406        0.406        0.406   
----------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
(est1 stored)
(est2 stored)
(est3 stored)
(est4 stored)
(est5 stored)
(est6 stored)

----------------------------------------------------------------------------------------
                 (1)          (2)          (3)          (4)          (5)          (6)   
            rev_iptu     rev_iptu     rev_iptu     rev_iptu     rev_iptu     rev_iptu   
----------------------------------------------------------------------------------------
log_fao        0.142                                                                    
             (0.203)                                                                    

log_pqsh~s                 -0.165                                                       
                         (0.0859)                                                       

dq10red2~o                              0.0532                                          
                                      (0.0329)                                          

dq10red2~h                                          -0.0362                             
                                                   (0.0342)                             

dq25red2~o                                                        0.0224                
                                                                (0.0241)                

dq25red2~h                                                                    -0.0211   
                                                                             (0.0246)   
----------------------------------------------------------------------------------------
N              60500        60137        60500        60500        60500        60500   
adj. R-sq      0.629        0.627        0.629        0.629        0.629        0.629   
----------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
(est1 stored)
(est2 stored)
(est3 stored)
(est4 stored)
(est5 stored)
(est6 stored)

----------------------------------------------------------------------------------------
                 (1)          (2)          (3)          (4)          (5)          (6)   
             rev_iss      rev_iss      rev_iss      rev_iss      rev_iss      rev_iss   
----------------------------------------------------------------------------------------
log_fao       0.0585                                                                    
             (0.211)                                                                    

log_pqsh~s                 -0.111                                                       
                         (0.0926)                                                       

dq10red2~o                              0.0342                                          
                                      (0.0363)                                          

dq10red2~h                                         -0.00851                             
                                                   (0.0377)                             

dq25red2~o                                                        0.0353                
                                                                (0.0260)                

dq25red2~h                                                                   -0.00922   
                                                                             (0.0268)   
----------------------------------------------------------------------------------------
N              60500        60137        60500        60500        60500        60500   
adj. R-sq      0.351        0.347        0.351        0.351        0.351        0.351   
----------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
(est1 stored)
(est2 stored)
(est3 stored)
(est4 stored)
(est5 stored)
(est6 stored)

----------------------------------------------------------------------------------------
                 (1)          (2)          (3)          (4)          (5)          (6)   
           rev_taxas    rev_taxas    rev_taxas    rev_taxas    rev_taxas    rev_taxas   
----------------------------------------------------------------------------------------
log_fao       -0.972***                                                                 
             (0.226)                                                                    

log_pqsh~s                 -0.168                                                       
                         (0.0938)                                                       

dq10red2~o                             -0.0838*                                         
                                      (0.0363)                                          

dq10red2~h                                           0.0261                             
                                                   (0.0372)                             

dq25red2~o                                                       -0.0968***             
                                                                (0.0269)                

dq25red2~h                                                                    -0.0317   
                                                                             (0.0272)   
----------------------------------------------------------------------------------------
N              60500        60137        60500        60500        60500        60500   
adj. R-sq      0.567        0.566        0.567        0.567        0.567        0.567   
----------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
(est1 stored)
(est2 stored)
(est3 stored)
(est4 stored)
(est5 stored)
(est6 stored)

----------------------------------------------------------------------------------------
                 (1)          (2)          (3)          (4)          (5)          (6)   
             rev_tot      rev_tot      rev_tot      rev_tot      rev_tot      rev_tot   
----------------------------------------------------------------------------------------
log_fao       -0.328                                                                    
             (0.213)                                                                    

log_pqsh~s                 -0.143                                                       
                         (0.0943)                                                       

dq10red2~o                            -0.00877                                          
                                      (0.0368)                                          

dq10red2~h                                          -0.0156                             
                                                   (0.0387)                             

dq25red2~o                                                       0.00574                
                                                                (0.0264)                

dq25red2~h                                                                   -0.00799   
                                                                             (0.0274)   
----------------------------------------------------------------------------------------
N              60500        60137        60500        60500        60500        60500   
adj. R-sq      0.330        0.327        0.330        0.330        0.330        0.330   
----------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
(est1 stored)
(est2 stored)
(est3 stored)
(est4 stored)
(est5 stored)
(est6 stored)

----------------------------------------------------------------------------------------
                 (1)          (2)          (3)          (4)          (5)          (6)   
             rev_fpm      rev_fpm      rev_fpm      rev_fpm      rev_fpm      rev_fpm   
----------------------------------------------------------------------------------------
log_fao       -0.271                                                                    
             (0.260)                                                                    

log_pqsh~s                 -0.159                                                       
                          (0.114)                                                       

dq10red2~o                             -0.0328                                          
                                      (0.0447)                                          

dq10red2~h                                          -0.0160                             
                                                   (0.0465)                             

dq25red2~o                                                        0.0144                
                                                                (0.0318)                

dq25red2~h                                                                    -0.0128   
                                                                             (0.0326)   
----------------------------------------------------------------------------------------
N              60500        60137        60500        60500        60500        60500   
adj. R-sq      0.212        0.210        0.212        0.212        0.212        0.212   
----------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
(est1 stored)
(est2 stored)
(est3 stored)
(est4 stored)
(est5 stored)
(est6 stored)

----------------------------------------------------------------------------------------
                 (1)          (2)          (3)          (4)          (5)          (6)   
           rev_cor~e    rev_cor~e    rev_cor~e    rev_cor~e    rev_cor~e    rev_cor~e   
----------------------------------------------------------------------------------------
log_fao       -0.286                                                                    
             (0.268)                                                                    

log_pqsh~s                 -0.159                                                       
                          (0.119)                                                       

dq10red2~o                             -0.0259                                          
                                      (0.0462)                                          

dq10red2~h                                          -0.0134                             
                                                   (0.0486)                             

dq25red2~o                                                        0.0145                
                                                                (0.0332)                

dq25red2~h                                                                   -0.00996   
                                                                             (0.0341)   
----------------------------------------------------------------------------------------
N              60500        60137        60500        60500        60500        60500   
adj. R-sq      0.210        0.208        0.210        0.210        0.210        0.210   
----------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
(est1 stored)
(est2 stored)
(est3 stored)
(est4 stored)
(est5 stored)
(est6 stored)

----------------------------------------------------------------------------------------
                 (1)          (2)          (3)          (4)          (5)          (6)   
           rev_orcam    rev_orcam    rev_orcam    rev_orcam    rev_orcam    rev_orcam   
----------------------------------------------------------------------------------------
log_fao       -0.291                                                                    
             (0.268)                                                                    

log_pqsh~s                 -0.158                                                       
                          (0.119)                                                       

dq10red2~o                             -0.0259                                          
                                      (0.0462)                                          

dq10red2~h                                          -0.0129                             
                                                   (0.0485)                             

dq25red2~o                                                        0.0141                
                                                                (0.0331)                

dq25red2~h                                                                   -0.00908   
                                                                             (0.0341)   
----------------------------------------------------------------------------------------
N              60500        60137        60500        60500        60500        60500   
adj. R-sq      0.210        0.207        0.210        0.210        0.210        0.210   
----------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
(est1 stored)
(est2 stored)
(est3 stored)
(est4 stored)
(est5 stored)
(est6 stored)

----------------------------------------------------------------------------------------
                 (1)          (2)          (3)          (4)          (5)          (6)   
           transf_~a    transf_~a    transf_~a    transf_~a    transf_~a    transf_~a   
----------------------------------------------------------------------------------------
log_fao        0.275                                                                    
             (0.198)                                                                    

log_pqsh~s                 0.0174                                                       
                         (0.0868)                                                       

dq10red2~o                              0.0327                                          
                                      (0.0336)                                          

dq10red2~h                                           0.0161                             
                                                   (0.0349)                             

dq25red2~o                                                        0.0583*               
                                                                (0.0242)                

dq25red2~h                                                                     0.0175   
                                                                             (0.0247)   
----------------------------------------------------------------------------------------
N              60500        60137        60500        60500        60500        60500   
adj. R-sq      0.523        0.522        0.523        0.523        0.523        0.523   
----------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
(est1 stored)
(est2 stored)
(est3 stored)
(est4 stored)
(est5 stored)
(est6 stored)

----------------------------------------------------------------------------------------
                 (1)          (2)          (3)          (4)          (5)          (6)   
           transf_~s    transf_~s    transf_~s    transf_~s    transf_~s    transf_~s   
----------------------------------------------------------------------------------------
log_fao       -0.100                                                                    
             (0.240)                                                                    

log_pqsh~s                 -0.114                                                       
                          (0.106)                                                       

dq10red2~o                            -0.00808                                          
                                      (0.0410)                                          

dq10red2~h                                          -0.0227                             
                                                   (0.0433)                             

dq25red2~o                                                        0.0251                
                                                                (0.0296)                

dq25red2~h                                                                   -0.00641   
                                                                             (0.0301)   
----------------------------------------------------------------------------------------
N              60500        60137        60500        60500        60500        60500   
adj. R-sq      0.295        0.293        0.295        0.295        0.295        0.295   
----------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
(est1 stored)
(est2 stored)
(est3 stored)
(est4 stored)
(est5 stored)
(est6 stored)

----------------------------------------------------------------------------------------
                 (1)          (2)          (3)          (4)          (5)          (6)   
           transf_~d    transf_~d    transf_~d    transf_~d    transf_~d    transf_~d   
----------------------------------------------------------------------------------------
log_fao      -0.0950                                                                    
             (0.240)                                                                    

log_pqsh~s                 -0.126                                                       
                          (0.105)                                                       

dq10red2~o                            -0.00934                                          
                                      (0.0411)                                          

dq10red2~h                                          -0.0251                             
                                                   (0.0434)                             

dq25red2~o                                                        0.0260                
                                                                (0.0295)                

dq25red2~h                                                                   -0.00742   
                                                                             (0.0301)   
----------------------------------------------------------------------------------------
N              60500        60137        60500        60500        60500        60500   
adj. R-sq      0.298        0.296        0.298        0.298        0.298        0.298   
----------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. foreach v of varlist exp_corrente-exp_transp{
  2. 
. eststo clear
  3. 
. eststo clear
  4. 
. eststo: qui reghdfe `v' log_fao c.altitude#i.year c.dist_federal#i.year c.dist_state#i.year c.log_area#i.year ///
>                            c.latitude#i.year c.longitude#i.year ///
>                            c.capital_dummy#i.year, absorb (cod year) vce(cluster cod)
  5.                            
. eststo: qui reghdfe `v' log_pqshares c.altitude#i.year c.dist_federal#i.year c.dist_state#i.year c.log_area#i.year ///
>                            c.latitude#i.year c.longitude#i.year ///
>                            c.capital_dummy#i.year, absorb (cod year) vce(cluster cod)
  6.                            
. eststo: qui reghdfe `v' dq10red2_fao c.altitude#i.year c.dist_federal#i.year c.dist_state#i.year c.log_area#i.year ///
>                            c.latitude#i.year c.longitude#i.year ///
>                            c.capital_dummy#i.year, absorb (cod year) vce(cluster cod)
  7.                            
. eststo: qui reghdfe `v' dq10red2_sh c.altitude#i.year c.dist_federal#i.year c.dist_state#i.year c.log_area#i.year ///
>                            c.latitude#i.year c.longitude#i.year ///
>                            c.capital_dummy#i.year, absorb (cod year) vce(cluster cod)
  8.                            
. eststo: qui reghdfe `v' dq25red2_fao c.altitude#i.year c.dist_federal#i.year c.dist_state#i.year c.log_area#i.year ///
>                            c.latitude#i.year c.longitude#i.year ///
>                            c.capital_dummy#i.year, absorb (cod year) vce(cluster cod)
  9.                            
. eststo: qui reghdfe `v' dq25red2_sh c.altitude#i.year c.dist_federal#i.year c.dist_state#i.year c.log_area#i.year ///
>                            c.latitude#i.year c.longitude#i.year ///
>                            c.capital_dummy#i.year, absorb (cod year) vce(cluster cod)
 10. 
. esttab, se ar2 keep(log_fao log_pqshares dq10red2_fao dq10red2_sh dq25red2_fao dq25red2_sh) compress
 11. 
. }
(est1 stored)
(est2 stored)
(est3 stored)
(est4 stored)
(est5 stored)
(est6 stored)

----------------------------------------------------------------------------------------
                 (1)          (2)          (3)          (4)          (5)          (6)   
           exp_cor~e    exp_cor~e    exp_cor~e    exp_cor~e    exp_cor~e    exp_cor~e   
----------------------------------------------------------------------------------------
log_fao       -0.237                                                                    
             (0.265)                                                                    

log_pqsh~s                 -0.160                                                       
                          (0.117)                                                       

dq10red2~o                             -0.0155                                          
                                      (0.0452)                                          

dq10red2~h                                          -0.0264                             
                                                   (0.0475)                             

dq25red2~o                                                        0.0205                
                                                                (0.0326)                

dq25red2~h                                                                    -0.0167   
                                                                             (0.0335)   
----------------------------------------------------------------------------------------
N              60500        60137        60500        60500        60500        60500   
adj. R-sq      0.210        0.207        0.210        0.210        0.210        0.210   
----------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
(est1 stored)
(est2 stored)
(est3 stored)
(est4 stored)
(est5 stored)
(est6 stored)

----------------------------------------------------------------------------------------
                 (1)          (2)          (3)          (4)          (5)          (6)   
            exp_educ     exp_educ     exp_educ     exp_educ     exp_educ     exp_educ   
----------------------------------------------------------------------------------------
log_fao       -0.157                                                                    
             (0.264)                                                                    

log_pqsh~s                 -0.159                                                       
                          (0.118)                                                       

dq10red2~o                             0.00403                                          
                                      (0.0453)                                          

dq10red2~h                                          -0.0125                             
                                                   (0.0484)                             

dq25red2~o                                                        0.0211                
                                                                (0.0328)                

dq25red2~h                                                                    -0.0137   
                                                                             (0.0340)   
----------------------------------------------------------------------------------------
N              60500        60137        60500        60500        60500        60500   
adj. R-sq      0.180        0.178        0.180        0.180        0.180        0.180   
----------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
(est1 stored)
(est2 stored)
(est3 stored)
(est4 stored)
(est5 stored)
(est6 stored)

----------------------------------------------------------------------------------------
                 (1)          (2)          (3)          (4)          (5)          (6)   
           exp_fun~l    exp_fun~l    exp_fun~l    exp_fun~l    exp_fun~l    exp_fun~l   
----------------------------------------------------------------------------------------
log_fao       -0.135                                                                    
             (0.272)                                                                    

log_pqsh~s                 -0.139                                                       
                          (0.121)                                                       

dq10red2~o                            0.000734                                          
                                      (0.0465)                                          

dq10red2~h                                          -0.0185                             
                                                   (0.0498)                             

dq25red2~o                                                        0.0289                
                                                                (0.0336)                

dq25red2~h                                                                   -0.00726   
                                                                             (0.0349)   
----------------------------------------------------------------------------------------
N              60500        60137        60500        60500        60500        60500   
adj. R-sq      0.201        0.198        0.201        0.201        0.201        0.201   
----------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
(est1 stored)
(est2 stored)
(est3 stored)
(est4 stored)
(est5 stored)
(est6 stored)

----------------------------------------------------------------------------------------
                 (1)          (2)          (3)          (4)          (5)          (6)   
           exp_habit    exp_habit    exp_habit    exp_habit    exp_habit    exp_habit   
----------------------------------------------------------------------------------------
log_fao       -0.585*                                                                   
             (0.290)                                                                    

log_pqsh~s                 -0.321*                                                      
                          (0.126)                                                       

dq10red2~o                             -0.0770                                          
                                      (0.0490)                                          

dq10red2~h                                          -0.0808                             
                                                   (0.0507)                             

dq25red2~o                                                       -0.0226                
                                                                (0.0349)                

dq25red2~h                                                                    -0.0532   
                                                                             (0.0360)   
----------------------------------------------------------------------------------------
N              60500        60137        60500        60500        60500        60500   
adj. R-sq      0.251        0.250        0.251        0.251        0.251        0.251   
----------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
(est1 stored)
(est2 stored)
(est3 stored)
(est4 stored)
(est5 stored)
(est6 stored)

----------------------------------------------------------------------------------------
                 (1)          (2)          (3)          (4)          (5)          (6)   
           exp_orcam    exp_orcam    exp_orcam    exp_orcam    exp_orcam    exp_orcam   
----------------------------------------------------------------------------------------
log_fao       -0.210                                                                    
             (0.267)                                                                    

log_pqsh~s                 -0.153                                                       
                          (0.118)                                                       

dq10red2~o                             -0.0130                                          
                                      (0.0456)                                          

dq10red2~h                                          -0.0197                             
                                                   (0.0478)                             

dq25red2~o                                                        0.0198                
                                                                (0.0329)                

dq25red2~h                                                                    -0.0138   
                                                                             (0.0337)   
----------------------------------------------------------------------------------------
N              60500        60137        60500        60500        60500        60500   
adj. R-sq      0.211        0.209        0.211        0.211        0.211        0.211   
----------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
(est1 stored)
(est2 stored)
(est3 stored)
(est4 stored)
(est5 stored)
(est6 stored)

----------------------------------------------------------------------------------------
                 (1)          (2)          (3)          (4)          (5)          (6)   
            exp_prev     exp_prev     exp_prev     exp_prev     exp_prev     exp_prev   
----------------------------------------------------------------------------------------
log_fao       -0.183                                                                    
             (0.251)                                                                    

log_pqsh~s                 -0.244*                                                      
                          (0.110)                                                       

dq10red2~o                             0.00148                                          
                                      (0.0417)                                          

dq10red2~h                                          -0.0858                             
                                                   (0.0455)                             

dq25red2~o                                                        0.0165                
                                                                (0.0307)                

dq25red2~h                                                                    -0.0349   
                                                                             (0.0317)   
----------------------------------------------------------------------------------------
N              60499        60136        60499        60499        60499        60499   
adj. R-sq      0.232        0.231        0.232        0.232        0.232        0.232   
----------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
(est1 stored)
(est2 stored)
(est3 stored)
(est4 stored)
(est5 stored)
(est6 stored)

----------------------------------------------------------------------------------------
                 (1)          (2)          (3)          (4)          (5)          (6)   
           exp_saude    exp_saude    exp_saude    exp_saude    exp_saude    exp_saude   
----------------------------------------------------------------------------------------
log_fao       -0.248                                                                    
             (0.260)                                                                    

log_pqsh~s                 -0.186                                                       
                          (0.117)                                                       

dq10red2~o                            -0.00341                                          
                                      (0.0446)                                          

dq10red2~h                                          -0.0366                             
                                                   (0.0482)                             

dq25red2~o                                                        0.0112                
                                                                (0.0324)                

dq25red2~h                                                                    -0.0208   
                                                                             (0.0338)   
----------------------------------------------------------------------------------------
N              60500        60137        60500        60500        60500        60500   
adj. R-sq      0.197        0.195        0.196        0.197        0.196        0.196   
----------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
(est1 stored)
(est2 stored)
(est3 stored)
(est4 stored)
(est5 stored)
(est6 stored)

----------------------------------------------------------------------------------------
                 (1)          (2)          (3)          (4)          (5)          (6)   
           exp_seg~n    exp_seg~n    exp_seg~n    exp_seg~n    exp_seg~n    exp_seg~n   
----------------------------------------------------------------------------------------
log_fao       -0.888**                                                                  
             (0.326)                                                                    

log_pqsh~s                 -0.353**                                                     
                          (0.133)                                                       

dq10red2~o                              -0.117*                                         
                                      (0.0515)                                          

dq10red2~h                                           -0.101                             
                                                   (0.0522)                             

dq25red2~o                                                       -0.0812*               
                                                                (0.0379)                

dq25red2~h                                                                    -0.0748   
                                                                             (0.0384)   
----------------------------------------------------------------------------------------
N              60500        60137        60500        60500        60500        60500   
adj. R-sq      0.614        0.614        0.614        0.614        0.614        0.614   
----------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
(est1 stored)
(est2 stored)
(est3 stored)
(est4 stored)
(est5 stored)
(est6 stored)

----------------------------------------------------------------------------------------
                 (1)          (2)          (3)          (4)          (5)          (6)   
           exp_tra~p    exp_tra~p    exp_tra~p    exp_tra~p    exp_tra~p    exp_tra~p   
----------------------------------------------------------------------------------------
log_fao      -0.0692                                                                    
             (0.398)                                                                    

log_pqsh~s                 -0.266                                                       
                          (0.167)                                                       

dq10red2~o                             -0.0169                                          
                                      (0.0618)                                          

dq10red2~h                                           -0.152*                            
                                                   (0.0650)                             

dq25red2~o                                                        0.0132                
                                                                (0.0450)                

dq25red2~h                                                                    -0.0836   
                                                                             (0.0471)   
----------------------------------------------------------------------------------------
N              60500        60137        60500        60500        60500        60500   
adj. R-sq      0.487        0.484        0.487        0.487        0.487        0.487   
----------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. log close 
      name:  <unnamed>
       log:  C:\Users\Andrei\Desktop\Dissertation\Dados\master_thesis\StataFiles\fao_fin.log
  log type:  text
 closed on:  28 Oct 2020, 19:24:30
-------------------------------------------------------------------------------------------------------------------------
