-------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Andrei\Desktop\Dissertation\Dados\master_thesis\StataFiles\itr_conv_final.log
  log type:  text
 opened on:  18 Nov 2020, 09:08:57

. 
. 
. gen dpq1 = pq_2010 - pq_2000

. gen dpq2 = pq_2015 - pq_2000

. gen dpq3 = log_pq_2010 - log_pq_2000

. gen dpq4 = log_pq_2015 - log_pq_2000

. gen dpq5 = log(dpq1)

. gen dpq6 = log(dpq2)
(4 missing values generated)

. 
. 
. 
. gen dbtk1 = btk_2010 - btk_2000

. gen dbtk2 = btk_2015 - btk_2000

. gen dbtk3 = log_btk_2010 - log_btk_2000
(96 missing values generated)

. gen dbtk4 = log_btk_2015 - log_btk_2000
(96 missing values generated)

. gen dbtk5 = log(dbtk1)
(96 missing values generated)

. gen dbtk6 = log(dbtk2)
(183 missing values generated)

. 
. 
. 
. eststo clear

. 
. foreach v of varlist dpq3-dpq4{
  2. eststo: qui reg dummy_op_2010 `v' dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy, robust
  3. }
(est1 stored)
(est2 stored)

. esttab, se ar2 keep(dpq3 dpq4) compress

------------------------------------
                 (1)          (2)   
           dummy_o~0    dummy_o~0   
------------------------------------
dpq3          0.0434                
            (0.0668)                

dpq4                       -0.290***
                         (0.0457)   
------------------------------------
N               5501         5501   
adj. R-sq      0.127        0.130   
------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. eststo clear

. eststo: qui ivreg2 dummy_op_2010 dist_state dist_federal log_area latitude ///
>  longitude altitude capital_dummy (dbtk3 = dpq3), robust ffirst savefirst
(est1 stored)

. 
.  eststo: estimates restore _ivreg2_dbtk3
(results _ivreg2_dbtk3 are active now)
(est2 stored)

. 
.  eststo: qui ivreg2 dummy_op_2010 dist_state dist_federal log_area latitude ///
>  longitude altitude capital_dummy (dbtk4 = dpq4), robust ffirst savefirst
(est3 stored)

. 
.  eststo: estimates restore _ivreg2_dbtk4
(results _ivreg2_dbtk4 are active now)
(est4 stored)

.  
.  
.  
.  esttab, se ar2 stat (widstat) keep(dpq3 dpq4 dbtk3 dbtk4) compress

--------------------------------------------------------------
                 (1)          (2)          (3)          (4)   
           dummy_o~0        dbtk3    dummy_o~0        dbtk4   
--------------------------------------------------------------
dbtk3         0.0619                                          
            (0.0796)                                          

dpq3                        0.843***                          
                         (0.0232)                             

dbtk4                                   -0.396***             
                                      (0.0646)                

dpq4                                                  0.734***
                                                   (0.0303)   
--------------------------------------------------------------
widstat       1316.1                     586.7                
--------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
.  
. 
. eststo clear

. 
. foreach v of varlist dpq3-dpq4{
  2. eststo: qui reg dummy_conv_op_2010 `v' dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy, robust
  3. }
(est1 stored)
(est2 stored)

. esttab, se ar2 keep(dpq3 dpq4) compress

------------------------------------
                 (1)          (2)   
           dummy_c..    dummy_c..   
------------------------------------
dpq3           0.101                
            (0.0531)                

dpq4                       -0.284***
                         (0.0361)   
------------------------------------
N               5501         5501   
adj. R-sq      0.155        0.158   
------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
.  eststo clear

. eststo: qui ivreg2 dummy_conv_op_2010 dist_state dist_federal log_area latitude ///
>  longitude altitude capital_dummy (dbtk3 = dpq3), robust ffirst savefirst
(est1 stored)

. 
.  eststo: estimates restore _ivreg2_dbtk3
(results _ivreg2_dbtk3 are active now)
(est2 stored)

. 
.  eststo: qui ivreg2 dummy_conv_op_2010 dist_state dist_federal log_area latitude ///
>  longitude altitude capital_dummy (dbtk4 = dpq4), robust ffirst savefirst
(est3 stored)

. 
.  eststo: estimates restore _ivreg2_dbtk4
(results _ivreg2_dbtk4 are active now)
(est4 stored)

.  
.  
.  esttab, se ar2 stat (widstat) keep(dpq3 dpq4 dbtk3 dbtk4) compress

--------------------------------------------------------------
                 (1)          (2)          (3)          (4)   
           dummy_c..        dbtk3    dummy_c..        dbtk4   
--------------------------------------------------------------
dbtk3          0.127*                                         
            (0.0632)                                          

dpq3                        0.843***                          
                         (0.0232)                             

dbtk4                                   -0.391***             
                                      (0.0541)                

dpq4                                                  0.734***
                                                   (0.0303)   
--------------------------------------------------------------
widstat       1316.1                     586.7                
--------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. 
. 
. 
. eststo clear

. 
. foreach v of varlist dpq3-dpq4{
  2. eststo: qui reg dummy_op_2015 `v' dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy, robust
  3. }
(est1 stored)
(est2 stored)

. esttab, se ar2 keep(dpq3 dpq4) compress

------------------------------------
                 (1)          (2)   
           dummy_o~5    dummy_o~5   
------------------------------------
dpq3           0.149                
            (0.0777)                

dpq4                       -0.266***
                         (0.0642)   
------------------------------------
N               5501         5501   
adj. R-sq      0.155        0.156   
------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. 
.  eststo clear

. eststo: qui ivreg2 dummy_op_2015 dist_state dist_federal log_area latitude ///
>  longitude altitude capital_dummy (dbtk3 = dpq3), robust ffirst savefirst
(est1 stored)

. 
.  eststo: estimates restore _ivreg2_dbtk3
(results _ivreg2_dbtk3 are active now)
(est2 stored)

. 
.  eststo: qui ivreg2 dummy_op_2015 dist_state dist_federal log_area latitude ///
>  longitude altitude capital_dummy (dbtk4 = dpq4), robust ffirst savefirst
(est3 stored)

. 
.  eststo: estimates restore _ivreg2_dbtk4
(results _ivreg2_dbtk4 are active now)
(est4 stored)

.  
.  
.  
.  esttab, se ar2 stat (widstat) keep(dpq3 dpq4 dbtk3 dbtk4) compress

--------------------------------------------------------------
                 (1)          (2)          (3)          (4)   
           dummy_o~5        dbtk3    dummy_o~5        dbtk4   
--------------------------------------------------------------
dbtk3          0.190*                                         
            (0.0926)                                          

dpq3                        0.843***                          
                         (0.0232)                             

dbtk4                                   -0.363***             
                                      (0.0899)                

dpq4                                                  0.734***
                                                   (0.0303)   
--------------------------------------------------------------
widstat       1316.1                     586.7                
--------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. 
. 
. 
. 
. eststo clear

. 
. foreach v of varlist dpq3-dpq4{
  2. eststo: qui reg dummy_conv_op_2015 `v' dist_state dist_federal log_area latitude ///
>                 longitude altitude capital_dummy, robust
  3. }
(est1 stored)
(est2 stored)

. esttab, se ar2 keep(dpq3 dpq4) compress

------------------------------------
                 (1)          (2)   
           dummy_c..    dummy_c..   
------------------------------------
dpq3           0.123*               
            (0.0601)                

dpq4                       -0.295***
                         (0.0428)   
------------------------------------
N               5501         5501   
adj. R-sq      0.189        0.192   
------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. eststo clear

. 
. 
.  
.  eststo clear

. eststo: qui ivreg2 dummy_conv_op_2015 dist_state dist_federal log_area latitude ///
>  longitude altitude capital_dummy (dbtk3 = dpq3), robust ffirst savefirst
(est1 stored)

. 
.  eststo: estimates restore _ivreg2_dbtk3
(results _ivreg2_dbtk3 are active now)
(est2 stored)

. 
.  eststo: qui ivreg2 dummy_conv_op_2015 dist_state dist_federal log_area latitude ///
>  longitude altitude capital_dummy (dbtk4 = dpq4), robust ffirst savefirst
(est3 stored)

. 
.  eststo: estimates restore _ivreg2_dbtk4
(results _ivreg2_dbtk4 are active now)
(est4 stored)

.  
.  
.  
.  esttab, se ar2 stat (widstat) keep(dpq3 dpq4 dbtk3 dbtk4) compress

--------------------------------------------------------------
                 (1)          (2)          (3)          (4)   
           dummy_c..        dbtk3    dummy_c..        dbtk4   
--------------------------------------------------------------
dbtk3          0.154*                                         
            (0.0717)                                          

dpq3                        0.843***                          
                         (0.0232)                             

dbtk4                                   -0.406***             
                                      (0.0616)                

dpq4                                                  0.734***
                                                   (0.0303)   
--------------------------------------------------------------
widstat       1316.1                     586.7                
--------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

.  
.  
.  
. 
. log close
      name:  <unnamed>
       log:  C:\Users\Andrei\Desktop\Dissertation\Dados\master_thesis\StataFiles\itr_conv_final.log
  log type:  text
 closed on:  18 Nov 2020, 09:09:00
-------------------------------------------------------------------------------------------------------------------------
