-----------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Andrei\Desktop\Dissertation\Dados\master_thesis\StataFiles\municip_pib_final.log
  log type:  text
 opened on:  21 Oct 2020, 21:07:18

. 
end of do-file

. do "C:\Users\Andrei\AppData\Local\Temp\STD00000000.tmp"

. foreach v of varlist log_pib_tot_pc-log_pib_serv_pc {
  2.         eststo clear
  3.         eststo: qui reghdfe `v' log_pq_shares          c.dist_state#i.year c.dist_federal#i.year c.geo_area_
> 2010#i.year c.latitude#i.year c.longitude#i.year c.altitude#i.year c.capital_dummy#i.year, absorb (cod year) vc
> e(cluster cod)
  4.         eststo: qui reghdfe `v' log_pq_shares_partial  c.dist_state#i.year c.dist_federal#i.year c.geo_area_
> 2010#i.year c.latitude#i.year c.longitude#i.year c.altitude#i.year c.capital_dummy#i.year, absorb (cod year) vc
> e(cluster cod) 
  5.         esttab, se ar2 keep(log_pq_shares log_pq_shares_resid log_pq_shares_partial log_pq_shares_resid_2)
  6. }
(est1 stored)
(est2 stored)
coefficient log_pq_shares_resid not found
r(111);

end of do-file

r(111);

. do "C:\Users\Andrei\AppData\Local\Temp\STD00000000.tmp"

. foreach v of varlist log_pib_tot_pc-log_pib_serv_pc {
  2.         eststo clear
  3.         eststo: qui reghdfe `v' log_pq_shares          c.dist_state#i.year c.dist_federal#i.year c.geo_area_
> 2010#i.year c.latitude#i.year c.longitude#i.year c.altitude#i.year c.capital_dummy#i.year, absorb (cod year) vc
> e(cluster cod)
  4.         eststo: qui reghdfe `v' log_pq_shares_partial  c.dist_state#i.year c.dist_federal#i.year c.geo_area_
> 2010#i.year c.latitude#i.year c.longitude#i.year c.altitude#i.year c.capital_dummy#i.year, absorb (cod year) vc
> e(cluster cod) 
  5.         esttab, se ar2 keep(log_pq_shares log_pq_shares_partial)
  6. }
(est1 stored)
(est2 stored)

--------------------------------------------
                      (1)             (2)   
             log_pib_to~c    log_pib_to~c   
--------------------------------------------
log_pq_sha~s       0.0608***                
                (0.00845)                   

log_pq_sha~l                       0.0302***
                                (0.00914)   
--------------------------------------------
N                   88000           79472   
adj. R-sq           0.942           0.943   
--------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
(est1 stored)
(est2 stored)

--------------------------------------------
                      (1)             (2)   
             log_pib_ag~c    log_pib_ag~c   
--------------------------------------------
log_pq_sha~s        0.138***                
                 (0.0159)                   

log_pq_sha~l                       0.0594***
                                 (0.0171)   
--------------------------------------------
N                   88000           79472   
adj. R-sq           0.940           0.942   
--------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
(est1 stored)
(est2 stored)

--------------------------------------------
                      (1)             (2)   
             log_pib_in~c    log_pib_in~c   
--------------------------------------------
log_pq_sha~s       0.0484*                  
                 (0.0205)                   

log_pq_sha~l                     -0.00145   
                                 (0.0225)   
--------------------------------------------
N                   88000           79472   
adj. R-sq           0.908           0.908   
--------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
(est1 stored)
(est2 stored)

--------------------------------------------
                      (1)             (2)   
             log_pib_se~c    log_pib_se~c   
--------------------------------------------
log_pq_sha~s       0.0209***                
                (0.00569)                   

log_pq_sha~l                      0.00959   
                                (0.00621)   
--------------------------------------------
N                   88000           79472   
adj. R-sq           0.957           0.957   
--------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
end of do-file

. do "C:\Users\Andrei\AppData\Local\Temp\STD00000000.tmp"

. clear all

. 
. set more off,permanently
(set more preference recorded)

. 
. use "C:\Users\Andrei\Desktop\Dissertation\Dados\master_thesis\StataFiles\munic_2004.dta"
(Written by R.              )

. 
. log using "C:\Users\Andrei\Desktop\Dissertation\Dados\master_thesis\StataFiles\munic_2004.log"
log file already open
r(604);

end of do-file

r(604);

. log close
      name:  <unnamed>
       log:  C:\Users\Andrei\Desktop\Dissertation\Dados\master_thesis\StataFiles\municip_pib_final.log
  log type:  text
 closed on:  21 Oct 2020, 21:14:29
-----------------------------------------------------------------------------------------------------------------
