-------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Andrei\Desktop\Dissertation\Dados\master_thesis\StataFiles\pib_diff.log
  log type:  text
 opened on:  18 Nov 2020, 00:23:50

. 
. eststo clear    

. eststo: qui reg dlog_pib_tot dlog_fao, robust
(est1 stored)

. 
. eststo: qui reg dlog_pib_tot dlog_fao  dist_state dist_federal ///
>         log_area  latitude longitude altitude ///
>         capital_dummy, robust
(est2 stored)

. 
. eststo: qui reg dlog_pib_tot dlog_shares, robust
(est3 stored)

. 
. eststo: qui reg dlog_pib_tot dlog_shares  dist_state dist_federal ///
>         log_area  latitude longitude altitude ///
>         capital_dummy, robust
(est4 stored)

. 
. esttab, se ar2 keep(dlog_fao dlog_shares) compress

--------------------------------------------------------------
                 (1)          (2)          (3)          (4)   
           dlog_p~ot    dlog_p~ot    dlog_p~ot    dlog_p~ot   
--------------------------------------------------------------
dlog_fao      0.0586      -0.0789                             
            (0.0512)     (0.0613)                             

dlog_sha~s                             -0.0146      -0.0781*  
                                      (0.0330)     (0.0348)   
--------------------------------------------------------------
N               5500         5500         5467         5467   
adj. R-sq      0.000        0.016       -0.000        0.017   
--------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. 
. eststo clear

. 
. eststo: qui ivreg2 dlog_pib_tot (dlog_shares = dlog_fao), robust ffirst savefirst
(est1 stored)

.         
. eststo: qui ivreg2 dlog_pib_tot dist_state dist_federal latitude log_area ///
>  longitude altitude capital_dummy (dlog_shares = dlog_fao), robust ffirst savefirst
(est2 stored)

.  
. eststo: estimates restore _ivreg2_dlog_shares
(results _ivreg2_dlog_shares are active now)
(est3 stored)

.  
. esttab, se ar2 stat (widstat) keep(dlog_shares dlog_fao) compress

-------------------------------------------------
                 (1)          (2)          (3)   
           dlog_p~ot    dlog_p~ot    dlog_sh~s   
-------------------------------------------------
dlog_sha~s    0.0687       -0.100                
            (0.0608)     (0.0730)                

dlog_fao                                 0.843***
                                      (0.0232)   
-------------------------------------------------
widstat       1632.5       1315.8                
-------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. 
. 
. eststo clear    

. eststo: qui reg dlog_pib_agro dlog_fao, robust
(est1 stored)

. 
. eststo: qui reg dlog_pib_agro dlog_fao  dist_state dist_federal ///
>         log_area  latitude longitude altitude ///
>         capital_dummy, robust
(est2 stored)

. 
. eststo: qui reg dlog_pib_agro dlog_shares, robust
(est3 stored)

. 
. eststo: qui reg dlog_pib_agro dlog_shares  dist_state dist_federal ///
>         log_area  latitude longitude altitude ///
>         capital_dummy, robust
(est4 stored)

. 
. esttab, se ar2 keep(dlog_fao dlog_shares) compress

--------------------------------------------------------------
                 (1)          (2)          (3)          (4)   
           dlog_pi~o    dlog_pi~o    dlog_pi~o    dlog_pi~o   
--------------------------------------------------------------
dlog_fao       0.525***     1.026***                          
            (0.0980)      (0.126)                             

dlog_sha~s                               0.164*       0.277***
                                      (0.0696)     (0.0761)   
--------------------------------------------------------------
N               5495         5495         5467         5467   
adj. R-sq      0.004        0.037        0.001        0.029   
--------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. 
. eststo clear

. 
. eststo: qui ivreg2 dlog_pib_agro (dlog_shares = dlog_fao), robust ffirst savefirst
(est1 stored)

.         
. eststo: qui ivreg2 dlog_pib_agro dist_state dist_federal latitude log_area ///
>  longitude altitude capital_dummy (dlog_shares = dlog_fao), robust ffirst savefirst
(est2 stored)

.  
. eststo: estimates restore _ivreg2_dlog_shares
(results _ivreg2_dlog_shares are active now)
(est3 stored)

.  
. esttab, se ar2 stat (widstat) keep(dlog_shares dlog_fao) compress

-------------------------------------------------
                 (1)          (2)          (3)   
           dlog_pi~o    dlog_pi~o    dlog_sh~s   
-------------------------------------------------
dlog_sha~s     0.623***     1.219***             
             (0.117)      (0.154)                

dlog_fao                                 0.843***
                                      (0.0232)   
-------------------------------------------------
widstat       1632.5       1315.8                
-------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. 
. eststo clear    

. eststo: qui reg dlog_pib_indust dlog_fao, robust
(est1 stored)

. 
. eststo: qui reg dlog_pib_indust dlog_fao  dist_state dist_federal ///
>         log_area  latitude longitude altitude ///
>         capital_dummy, robust
(est2 stored)

. 
. eststo: qui reg dlog_pib_indust dlog_shares, robust
(est3 stored)

. 
. eststo: qui reg dlog_pib_indust dlog_shares  dist_state dist_federal ///
>         log_area  latitude longitude altitude ///
>         capital_dummy, robust
(est4 stored)

. 
. esttab, se ar2 keep(dlog_fao dlog_shares) compress

--------------------------------------------------------------
                 (1)          (2)          (3)          (4)   
           dlog_p~st    dlog_p~st    dlog_p~st    dlog_p~st   
--------------------------------------------------------------
dlog_fao       0.482***     0.137                             
             (0.117)      (0.136)                             

dlog_sha~s                             -0.0207       -0.140   
                                      (0.0769)     (0.0812)   
--------------------------------------------------------------
N               5500         5500         5467         5467   
adj. R-sq      0.003        0.032       -0.000        0.033   
--------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. 
. eststo clear

. 
. eststo: qui ivreg2 dlog_pib_indust (dlog_shares = dlog_fao), robust ffirst savefirst
(est1 stored)

.         
. eststo: qui ivreg2 dlog_pib_indust dist_state dist_federal latitude log_area ///
>  longitude altitude capital_dummy (dlog_shares = dlog_fao), robust ffirst savefirst
(est2 stored)

.  
. eststo: estimates restore _ivreg2_dlog_shares
(results _ivreg2_dlog_shares are active now)
(est3 stored)

.  
. esttab, se ar2 stat (widstat) keep(dlog_shares dlog_fao) compress

-------------------------------------------------
                 (1)          (2)          (3)   
           dlog_p~st    dlog_p~st    dlog_sh~s   
-------------------------------------------------
dlog_sha~s     0.571***     0.158                
             (0.140)      (0.162)                

dlog_fao                                 0.843***
                                      (0.0232)   
-------------------------------------------------
widstat       1632.5       1315.8                
-------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. 
. 
. 
. eststo clear    

. eststo: qui reg dlog_pib_serv dlog_fao, robust
(est1 stored)

. 
. eststo: qui reg dlog_pib_serv dlog_fao  dist_state dist_federal ///
>         log_area  latitude longitude altitude ///
>         capital_dummy, robust
(est2 stored)

. 
. eststo: qui reg dlog_pib_serv dlog_shares, robust
(est3 stored)

. 
. eststo: qui reg dlog_pib_serv dlog_shares  dist_state dist_federal ///
>         log_area  latitude longitude altitude ///
>         capital_dummy, robust
(est4 stored)

. 
. esttab, se ar2 keep(dlog_fao dlog_shares) compress

--------------------------------------------------------------
                 (1)          (2)          (3)          (4)   
           dlog_pi~v    dlog_pi~v    dlog_pi~v    dlog_pi~v   
--------------------------------------------------------------
dlog_fao      -0.129***    -0.427***                          
            (0.0387)     (0.0461)                             

dlog_sha~s                              -0.179***    -0.280***
                                      (0.0253)     (0.0251)   
--------------------------------------------------------------
N               5500         5500         5467         5467   
adj. R-sq      0.002        0.113        0.009        0.118   
--------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. 
. eststo clear

. 
. eststo: qui ivreg2 dlog_pib_serv (dlog_shares = dlog_fao), robust ffirst savefirst
(est1 stored)

.         
. eststo: qui ivreg2 dlog_pib_serv dist_state dist_federal latitude log_area ///
>  longitude altitude capital_dummy (dlog_shares = dlog_fao), robust ffirst savefirst
(est2 stored)

.  
. eststo: estimates restore _ivreg2_dlog_shares
(results _ivreg2_dlog_shares are active now)
(est3 stored)

.  
. esttab, se ar2 stat (widstat) keep(dlog_shares dlog_fao) compress

-------------------------------------------------
                 (1)          (2)          (3)   
           dlog_pi~v    dlog_pi~v    dlog_sh~s   
-------------------------------------------------
dlog_sha~s    -0.152***    -0.514***             
            (0.0456)     (0.0560)                

dlog_fao                                 0.843***
                                      (0.0232)   
-------------------------------------------------
widstat       1632.5       1315.8                
-------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. log close
      name:  <unnamed>
       log:  C:\Users\Andrei\Desktop\Dissertation\Dados\master_thesis\StataFiles\pib_diff.log
  log type:  text
 closed on:  18 Nov 2020, 00:23:56
-------------------------------------------------------------------------------------------------------------------------
